{
  "architectures": ["ViTForImageClassification"],
  "attention_probs_dropout_prob": 0.0,
  "drop_path": 0.1,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "image_size": 224,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-5,
  "model_type": "vit",
  "hidden_size": [176, 352, 704, 1408],
  "depths": [2, 2, 6, 2],
  "num_attention_heads": [1, 1, 4, 8],
  "num_hidden_layersA": 4,
  "num_hidden_layersB": 8,
  "intermediate_size": [1408, 2816, 2816, 5632],
  "num_channels": 3,
  "patch_size": 4,
  "qkv_bias": true,
  "window_size": 7,
  "transformers_version": "5.8.0"
}
